Repository: FabricioCarvalho348/CashFlow-Project
Catalog: src/CashFlow.Exception/ResourceErrorMessages.*.resx
Languages: pt_pt

# AMOUNT_MUST_BE_GREATER_THAN_ZERO
source: The Amount must be greater than zero
pt_pt: O montante deve ser maior que zero.

# EXPENSES_CANNOT_FOR_THE_FUTURE
source: Expenses cannot be for the future
pt_pt: As despesas não podem ser para o futuro.

# PAYMENT_TYPE_INVALID
source: Payment type is not valid
pt_pt: O tipo de pagamento não é válido.

# TITLE_REQUIRED
source: The title is required.
pt_pt: O títuto é obrigatório.

# UNKNOWN_VALUE
source: Unknown error
pt_pt: Erro desconhecido.

source: Expense not found
pt_pt: Despesa não encontrada

# EMAIL_EMPTY
source: The email cannot be empty.
pt_pt: A mensagem de correio eletrónico não pode estar vazia.

# EMAIL_INVALID
source: The email is invalid.
pt_pt: O correio eletrónico é inválido.

# INVALID_PASSWORD
source: Your password should be a minimum of 8 characters, containing at least one uppercase letter, one lowercase letter, one number, and one special character (e.g., !, ?, *, .).
pt_pt: A sua palavra-passe deve ter um mínimo de 8 caracteres, contendo pelo menos uma letra maiúscula, uma letra minúscula, um número e um carácter especial (por exemplo, !, ?, *, .).

# NAME_EMPTY
source: The name cannot be empty.
pt_pt: O nome não pode estar vazio.

# EMAIL_ALREADY_REGISTERED
source: This email is already in use.
pt_pt: Este correio eletrónico já está a ser utilizado.

# EMAIL_OR_PASSWORD_INVALID
source: Invalid e-mail and/or password.
pt_pt: E-mail e/ou palavra-passe inválidos.

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: The password entered is different from the current password.
pt_pt: A palavra-passe introduzida é diferente da palavra-passe atual.

# TAG_TYPE_NOT_SUPPORTED
source: Unsupported tag.
pt_pt: Etiqueta não suportada.
